var mock_data = {
    center_data: {
        line_hospital_count: 8,
        total_hospital_count: 50,
        this_year_sum: 8563,
        last_year_sum: 7975
    },
    center_chart: [
        { name: '梅江区', value: 20057.34, count: 3 },
        { name: '梅县区', value: 15477.48, count: 3 },
        { name: '大埔县', value: 31686.1, count: 3 },
        { name: '丰顺县', value: 6992.6, count: 3 },
        { name: '五华县', value: 44045.49, count: 3 },
        { name: '平远县', value: 40689.64, count: 3 },
        { name: '蕉岭县', value: 37659.78, count: 3 },
        { name: '兴宁市', value: 45180.97, count: 3 }
    ],
    left_chart_01: {
        hospitalNameArr: ['市人民医院', '粤东医院', '市二中医医院', '市中医院', '丰顺中医医院'],
        hospitalDataArr: [
            [350, 280, 283, 278, 266],
            [350, 280, 283, 278, 266]
        ]
    },
    left_chart_02: {
        xAxisDataArr: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
        indexDataArr: [
            [2.0, 4.9, 7.0, 23.2, 25.6, 76.7, 135.6, 162.2, 32.6, 20.0, 6.4, 3.3],
            [2.6, 5.9, 9.0, 26.4, 28.7, 70.7, 175.6, 182.2, 48.7, 18.8, 6.0, 2.3],
            [2.0, 2.2, 3.3, 4.5, 6.3, 10.2, 20.3, 23.4, 23.0, 16.5, 12.0, 6.2],
            [2.0, 1.2, 3.3, 1.5, 6.3, 3.2, 20.3, 33.4, 23.0, 36.5, 12.0, 16.2]
        ]
    },
    left_chart_03: [
        { value: 170, name: '甘草' },
        { value: 150, name: '丹参' },
        { value: 200, name: '浙贝母' },
        { value: 185, name: '川续断' },
        { value: 120, name: '倒吊黄' }
    ],
    right_chart_01: {
        xAxisDataArr: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
        indexDataArr: [
            [21, 29, 30, 32, 35, 33, 37, 38, 38, 40, 41.5, 45],
            [40, 45, 47, 49, 50, 58, 53, 60, 50, 58, 61.5, 64],
            [63, 65, 66, 62, 66, 68, 70, 62, 67, 73, 76.5, 78],
            [10, 9, 8, 11, 7, 5, 6, 9, 4, 3, 4.5, 7]
        ]
    },
    right_chart_02: [3000, 5563],
    right_table_03: [
        { name: '交易次数', month: '1,200', year: '9,300' },
        { name: '交易金额', month: '600万元', year: '3,500万元' },
        { name: '本地药企销售金额', month: '350万元', year: '2,100万元' },
        { name: '上线品种数', month: '18', year: '120' },
    ]
};